Documents/Награждение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Награждение</Name>
			<BasedOn>
				<xr:Item>Document.ПредставлениеКНаграде</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПредставлениеКНаграде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПредставлениеКНаграде</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СтатусыПредставленийКНаградам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПротокола</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПротокола</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительКадровогоПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредседательствующийНаОбщемСобрании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень сотрудников, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МотивПоощрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВручения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Согласования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДолжностногоЛица</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеДолжности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДолжностноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПретендентыКНаграждению</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Претендент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПретендентКНаграждению</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтажРаботыВОтрасли</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Награда</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыПредставленияКНаградам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставитьКНаграде</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Награды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаУстановкиСтатуса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПроцессыНагражденияКлиент/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ВариантыОтчетов

// См. ОтчетыКлиентПереопределяемый.ОбработчикКоманды.
//
Процедура ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	
	Если ФормаОтчета.ИмяФормы = "Отчет.ОтчетыПоПроцессамНаграждения.Форма" Тогда
		
		Если ТипЗнч(Команда) = Тип("ТаблицаФормы") И (Команда.Имя = "ИнтервалыНаграждения" ИЛИ Команда.Имя = "МинимальныеСтажиРаботы") Тогда
			ПроцессыНагражденияКлиентСервер.ЗаполнитьПараметрыОтчетаНаградыФизическихЛиц(ФормаОтчета);
		ИначеЕсли Команда.Имя = "ИсключатьРанееНагражденных" Тогда
			ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(ФормаОтчета);
		ИначеЕсли Команда.Имя = "ИсключатьПоСтажу" Тогда
			ПроцессыНагражденияКлиентСервер.УстановитьДоступностьЭлементовОтчетаНаградыФизическихЛиц(ФормаОтчета);
		ИначеЕсли Команда.Имя = "Наградить" Тогда
			ЗаполнитьДокументИзОтчета(ФормаОтчета, "ЗаполнитьДокументНаграждение");
		ИначеЕсли Команда.Имя = "ПредставитьКНаграде" Тогда
			ЗаполнитьДокументИзОтчета(ФормаОтчета, "ЗаполнитьДокументПредставлениеКНаграде");
		КонецЕсли;
		
		Результат = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик расшифровки табличного документа формы отчета.
// См. "ОтчетыКлиентПереопределяемый.ОбработкаРасшифровки".
//
Процедура ОбработкаРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	Если ФормаОтчета.НастройкиОтчета.ПолноеИмя = "Отчет.ОтчетыПоПроцессамНаграждения"
		И ФормаОтчета.НастройкиОтчета.КлючПредопределенногоВарианта = "ПодборКандидатов" Тогда
		
		НастройкиОтчетаРасшифровки = ПроцессыНагражденияВызовСервера.НастройкиОтчетаРасшифровки(ФормаОтчета.Отчет.КомпоновщикНастроек, ФормаОтчета.ОтчетДанныеРасшифровки, Расшифровка);
		
		Если Не НастройкиОтчетаРасшифровки = Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			
			ВариантыОтчетовКлиент.ОткрытьФормуОтчета(Неопределено, НастройкиОтчетаРасшифровки.ВариантОтчета);
			
			Оповестить(ИмяСобытияУстановитьОтборФормыОтчета(), НастройкиОтчетаРасшифровки);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик широковещательного оповещения формы отчета.
// См. ОтчетыКлиентПереопределяемый.ОбработкаОповещения.
//
//
Процедура ОбработкаОповещения(ФормаОтчета, ИмяСобытия, Параметр, Источник, ОповещениеОбработано) Экспорт
	
	Если ИмяСобытия = ИмяСобытияУстановитьОтборФормыОтчета() И ФормаОтчета.КлючТекущегоВарианта = "ДисциплинарныеВзыскания" Тогда
		
		ВариантОтчета = Параметр.ВариантОтчета;
		КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
		ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
		
		НовыеПользовательскиеНастройки = НовыеПользовательскиеНастройки(КомпоновщикНастроек, ПользовательскиеНастройки, Параметр.Отбор);
		
		КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(НовыеПользовательскиеНастройки);
		
		Попытка
			
			ПараметрыОбновления = ОтчетыКлиентСервер.ПараметрыОбновленияФормыОтчета();
			ПараметрыОбновления.КомпоновщикНастроекКД = КомпоновщикНастроек;
			ПараметрыОбновления.Переформировать = Истина;
			ПараметрыОбновления.ОбновитьНастройкиВарианта = Истина;
			
			ФормаОтчета.ПрименитьНастройкиИПереформироватьОтчет(ПараметрыОбновления, Неопределено);
			
			ФормаОтчета.ВариантМодифицирован = Ложь;
			ФормаОтчета.ПользовательскиеНастройкиМодифицированы = Ложь;
			
		Исключение
			
			ОтчетыКлиент.СформироватьОтчет(ФормаОтчета);
			
		КонецПопытки;
		
		ОповещениеОбработано = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

// См. ОтчетыКлиентПереопределяемый.ОбработкаДополнительнойРасшифровки.
//
Процедура ОбработкаДополнительнойРасшифровки(ФормаОтчета, Элемент, Расшифровка, СтандартнаяОбработка) Экспорт
	
	Если ФормаОтчета.НастройкиОтчета.ПолноеИмя = "Отчет.ОтчетыПоПроцессамНаграждения" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		КомпоновщикНастроек = ФормаОтчета.Отчет.КомпоновщикНастроек;
		
		ИменаПолейРасшифровки = Новый Массив;
		ИменаПолейРасшифровки.Добавить("ФизическоеЛицо");
		ИменаПолейРасшифровки.Добавить("Подразделение");
		ИменаПолейРасшифровки.Добавить("Организация");
		
		ИменаДокументов = Новый Массив;
		ИменаДокументов.Добавить("Награждение");
		ИменаДокументов.Добавить("ПредставлениеКНаграде");
		
		ПараметрыРасшифровки = ЗарплатаКадрыРасширенныйКлиент.НовыеПараметрыДополнительнойРасшифровкиОтчета();
		ПараметрыРасшифровки.ИменаПолейРасшифровки = ИменаПолейРасшифровки;
		ПараметрыРасшифровки.ИменаДокументов = ИменаДокументов;
		ПараметрыРасшифровки.ВариантОтчетаДляЗаполнения = (ФормаОтчета.КлючТекущегоВарианта = "ПодборКандидатов");
		ПараметрыРасшифровки.РегистраторРасшифровки = Неопределено;
		
		ЗарплатаКадрыРасширенныйКлиент.ОбработкаДополнительнойРасшифровкиТематическогоОтчета(ФормаОтчета, Расшифровка, ПараметрыРасшифровки, ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДокументИзОтчета(ФормаОтчета, КомандаЗаполнения = Неопределено) Экспорт
	
	Если ФормаОтчета.ОтчетДанныеРасшифровки = "" Тогда
		Возврат;
	КонецЕсли;
	
	МассивПолей = Новый Массив;
	МассивПолей.Добавить("Организация");
	МассивПолей.Добавить("Подразделение");
	МассивПолей.Добавить("Сотрудник");
	МассивПолей.Добавить("ФизическоеЛицо");
	МассивПолей.Добавить("Награда");
	
	Если ФормаОтчета.ХранилищеРезультатаОтчета = "" Тогда
		
		ФормаОтчета.ХранилищеРезультатаОтчета = ПроцессыНагражденияВызовСервера.ХранилищеТаблицыРезультатаОтчета(
			ФормаОтчета.Отчет.КомпоновщикНастроек,
			"ОтчетыПоПроцессамНаграждения",
			"ОсновнаяСхемаКомпоновкиДанных",
			МассивПолей);
			
	КонецЕсли;
		
	МассивПолейОтбора = Новый Массив;
	МассивПолейОтбора.Добавить("Организация");
	МассивПолейОтбора.Добавить("Подразделение");
	МассивПолейОтбора.Добавить("Сотрудник");
	
	МассивГруппировок = Новый Массив;
	МассивГруппировок.Добавить("Организация");
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("Сотрудник");
	МассивКолонок.Добавить("Награда");
	
	МассивДанных = ЗарплатаКадрыРасширенныйКлиент.ДанныеРасшифровкиИзОтчета(
		ФормаОтчета.ОтчетДанныеРасшифровки,
		ФормаОтчета.ХранилищеРезультатаОтчета,
		ФормаОтчета.ОтчетТабличныйДокумент,
		МассивПолейОтбора,
		МассивГруппировок,
		МассивКолонок);
		
	Если КомандаЗаполнения = "ЗаполнитьДокументНаграждение" Тогда
		Для Каждого СтруктураЗаполнения Из МассивДанных Цикл
			ОткрытьФорму("Документ.Награждение.Форма.ФормаДокумента", Новый Структура("Основание", СтруктураЗаполнения),,Истина);
		КонецЦикла;
	ИначеЕсли КомандаЗаполнения = "ЗаполнитьДокументПредставлениеКНаграде" Тогда
		Для Каждого СтруктураЗаполнения Из МассивДанных Цикл
			ОткрытьФорму("Документ.ПредставлениеКНаграде.Форма.ФормаДокумента", Новый Структура("Основание", СтруктураЗаполнения),,Истина);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПриИзмененииЭлементаТребованийПодбораКандидатов(Форма, Элемент) Экспорт
	
	ИмяЭлемента = Элемент.Имя;
	Если Не СтрНайти(ИмяЭлемента, "Флажок") = 0 Тогда
		ИмяЗависимогоЭлемента = СтрЗаменить(ИмяЭлемента, "Флажок", "");
		Элементформы = Форма.Элементы.Найти(ИмяЗависимогоЭлемента);
		Если Не Элементформы = Неопределено Тогда
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, ИмяЭлемента) Тогда
				ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, ИмяЗависимогоЭлемента, "Доступность", Форма[ИмяЭлемента]);
			КонецЕсли;
		КонецЕсли;
		Форма.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписьюНаграды(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если Не ПроцессыНагражденияВызовСервера.ИспользуютсяПроцессыНаграждения() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.ФлажокМинимальныйВозраст Тогда
		Форма.Объект.МинимальныйВозраст = 0;
	КонецЕсли;
	
	Если Не Форма.ФлажокМаксимальныйВозраст Тогда
		Форма.Объект.МаксимальныйВозраст = 0;
	КонецЕсли;
	
	Если Не Форма.ФлажокМинимальныеСтажиРаботы Тогда
		Форма.Объект.МинимальныеСтажиРаботы.Очистить();
	КонецЕсли;
	
	Если Не Форма.ФлажокОграничениеДолжностей Тогда
		Форма.Объект.ОграничениеДолжностей.Очистить();
	КонецЕсли;
	
	Если Не Форма.ФлажокИнтервалыНаграждения Тогда
		Форма.Объект.ИнтервалыНаграждения.Очистить();
	КонецЕсли;
	
	Если Не Форма.ФлажокНаличиеНаград Тогда
		Форма.Объект.НаличиеНаград.Очистить();
	КонецЕсли;

КонецПроцедуры

Процедура НаградыФизическихЛицПриНачалеРедактирования(Элемент) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элемент.ТекущиеДанные.ДокументРегистратор = Неопределено;
	
КонецПроцедуры

Процедура НаградыФизическихЛицПередУдалениемИзменением(Элемент, Отказ) Экспорт
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.ДокументРегистратор) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Функция ИмяСобытияУстановитьОтборФормыОтчета()
	Возврат "УстановитьОтборФормыОтчета";
КонецФункции

Функция НовыеПользовательскиеНастройки(Знач КомпоновщикНастроек, Знач ПользовательскиеНастройки, Знач НастройкиОтбора)
	
	НастройкиОтчета = КомпоновщикНастроек.Настройки;
	
	Для Каждого ГруппаОтбора Из НастройкиОтбора Цикл
		
		Для Каждого ЭлементОтбора Из ГруппаОтбора.Значение Цикл
			
			ИмяПоля = СтрШаблон("%1.%2", ГруппаОтбора.Ключ, ЭлементОтбора.Ключ);
			
			Для Каждого ЭлементОтбораКомпоновкиДанных Из НастройкиОтчета.Отбор.Элементы Цикл
				
				Если Не ЭлементОтбораКомпоновкиДанных.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля) Тогда
					Продолжить;
				КонецЕсли;
				
				ЭлементОтбораКомпоновкиДанных.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				ЭлементНастройки = ПользовательскиеНастройки.Элементы.Найти(ЭлементОтбораКомпоновкиДанных.ИдентификаторПользовательскойНастройки);
				
				Если Не ЭлементНастройки = Неопределено Тогда
					
					ЭлементНастройки.Использование = Истина;
					ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементНастройки.ПравоеЗначение = ЭлементОтбора.Значение;
					ЭлементНастройки.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
					
				КонецЕсли;
				
				Прервать;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

#КонецОбласти
